#### Filtering rows using[]
#### Label based indexing using ".loc"
#### Integer based indexing using ".iloc"

In [1]:
import pandas as pd
import seaborn as sns

In [3]:
df = sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [4]:
df['tip'].head()

0    1.01
1    1.66
2    3.50
3    3.31
4    3.61
Name: tip, dtype: float64

##### If you want the data back in Data Set, you have to put brackets one more time

In [6]:
##### The up one is a panda series, down one is DataFrame

In [7]:
df[['tip']].head()

    tip
0  1.01
1  1.66
2  3.50
3  3.31
4  3.61

### You can also select more than 1 colounm

In [8]:
df[['tip','sex']].head()

    tip     sex
0  1.01  Female
1  1.66    Male
2  3.50    Male
3  3.31    Male
4  3.61  Female

#### If you want to select rows you can do

In [9]:
df[3:5]

   total_bill   tip     sex smoker  day    time  size
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

##### Remember! Last index is not included!

In [10]:
list(range(0,3))

[0, 1, 2]

# .loc

In [11]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4


##### If you want to select one coloumn
##### The coloumn is the second index

In [12]:
df.loc[:,'tip']

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64

#### If you want to get it back in the DataFrame, you put it in the square brackets again

In [14]:
df.loc[:,['tip']]

      tip
0    1.01
1    1.66
2    3.50
3    3.31
4    3.61
..    ...
239  5.92
240  2.00
241  2.00
242  1.75
243  3.00

[244 rows x 1 columns]

###### Also you can add more coloumns

In [15]:
df.loc[:,['tip','sex']]

      tip     sex
0    1.01  Female
1    1.66    Male
2    3.50    Male
3    3.31    Male
4    3.61  Female
..    ...     ...
239  5.92    Male
240  2.00  Female
241  2.00    Male
242  1.75    Male
243  3.00  Female

[244 rows x 2 columns]

##### Instead of selecting everything, you can say, for example, give me from 1 to 3

In [21]:
df.loc[0:4,['tip','sex','time']]

    tip     sex    time
0  1.01  Female  Dinner
1  1.66    Male  Dinner
2  3.50    Male  Dinner
3  3.31    Male  Dinner
4  3.61  Female  Dinner

In [22]:
df.loc[3]

total_bill     23.68
tip             3.31
sex             Male
smoker            No
day              Sun
time          Dinner
size               2
Name: 3, dtype: object

##### If you say just .loc[3] it will give back all the info about specific sell
##### If you put it in double brackets, it will give back a DataFrame

In [24]:
df.loc[[3]]

   total_bill   tip   sex smoker  day    time  size
3       23.68  3.31  Male     No  Sun  Dinner     2

###### Also, you can select different rows to show up, for example

In [27]:
df.loc[[3,0,5]]

   total_bill   tip     sex smoker  day    time  size
3       23.68  3.31    Male     No  Sun  Dinner     2
0       16.99  1.01  Female     No  Sun  Dinner     2
5       25.29  4.71    Male     No  Sun  Dinner     4

#### The names of these rows are integers, thats why we use integers

In [31]:
df2 = df.set_index('sex')
df2
df2.head()

        total_bill   tip smoker  day    time  size
sex
Female       16.99  1.01     No  Sun  Dinner     2
Male         10.34  1.66     No  Sun  Dinner     3
Male         21.01  3.50     No  Sun  Dinner     3
Male         23.68  3.31     No  Sun  Dinner     2
Female       24.59  3.61     No  Sun  Dinner     4

##### Thats how you choose the main index

#### if you will say, for example 'Female' it will show up cells only with a female mark

In [37]:
df2.loc['Female'].head()

        total_bill   tip smoker  day    time  size
sex
Female       16.99  1.01     No  Sun  Dinner     2
Female       24.59  3.61     No  Sun  Dinner     4
Female       35.26  5.00     No  Sun  Dinner     4
Female       14.83  3.02     No  Sun  Dinner     2
Female       10.33  1.67     No  Sun  Dinner     3

#### if you want to see just some of the coloumns, you type
#### btw .head() stays for the seeing only beginning of the DataFrame

In [40]:
df2.loc['Female',['tip','day']].head()

         tip  day
sex
Female  1.01  Sun
Female  3.61  Sun
Female  5.00  Sun
Female  3.02  Sun
Female  1.67  Sun

# .iloc

In [41]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

#### Everything is integer based here, so!

In [46]:
df.iloc[1:4,[3,4]]

  smoker  day
1     No  Sun
2     No  Sun
3     No  Sun

##### Do not use names, because it works with integers only!!

##### First number stays for rows, second -- for the coloumns

# .iloc does integer-based indexing